//Pr1-2
//
//Создайте переменные типа int, char, double, boolean и строка.
//Проинициализируйте переменные литералами соответствующих типов. Выведите
//значения переменных в консоль.

package javaapplication2;

public class JavaApplication2 {
    public static void main(String[] args) {
        int a = 1;
        char b = 'A';
        double c = 1.25d;
        boolean d = true;
        String str = "Hello World";  
        System.out.println(a);
        System.out.println(b);
        System.out.println(c);
        System.out.println(d);
        System.out.println(str);
    }  
}
