//Pr1-1
//
//Напишите программу "hello, world" которая выводит это сообщение в
//консоль. Вам понадобится только один метод main, который выполняется,
//когда программа запускается на исполнение.

package javaapplication1;

public class JavaApplication1 {
    public static void main(String[] args) {
        System.out.println("Hello World!");
    }  
}



//
//Создайте переменные типа int, char, double, boolean и строка.
//Проинициализируйте переменные литералами соответствующих типов. Выведите
//значения переменных в консоль.

package javaapplication2;

public class JavaApplication2 {
    public static void main(String[] args) {
        int a = 1;
        char b = 'A';
        double c = 1.25d;
        boolean d = true;
        String str = "Hello World";  
        System.out.println(a);
        System.out.println(b);
        System.out.println(c);
        System.out.println(d);
        System.out.println(str);
    }  
}



//Pr1-3
//
//Напишите программу CheckPassFail, которая печатает "PASS", если
//целочисленная переменная “mark” больше или равна 50; и "FAIL" – в ином
//случае.

package checkpassfail;
import java.util.Scanner;

public class CheckPassFail {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
        System.out.print("Введите ваше значение: ");
        int mark;
        mark = in.nextInt();
        if (mark>=50)
            System.out.println("PASS");
        else
            System.out.println("FAIL");
    }   
}



//Pr1-4

//Напишите программу CheckOddEven, которая печатает "Odd Number", если
//целочисленная переменная “number” содержит нечетное значение; и "Even
//Number" – в ином случае.

//Прмечание: n  является четным, если (n % 2) равняется 0.

package checkoddeven;
import java.util.Scanner;

public class CheckOddEven {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
        System.out.print("Введите ваше число: ");
        int n;
        n = in.nextInt();
        if (n%2>0)
            System.out.println("Odd Number");
        else 
            System.out.println("Even Number");
    } 
}