//Pr1-1
//
//Напишите программу "hello, world" которая выводит это сообщение в
//консоль. Вам понадобится только один метод main, который выполняется,
//когда программа запускается на исполнение.

package javaapplication1;

public class JavaApplication1 {
    public static void main(String[] args) {
        System.out.println("Hello World!");
    }  
}
